title: Shadow Copy Deleted
status: experimental
description: Detecta exclusões de shadow copies através do utilitário wmic.exe
author: Sg0luc
date: 2023-09-06
references:
	- https://attack.mitre.org/techniques/T1490/
	- https://attack.mitre.org/software/S1068/
tags:
	- attack.impact
	- blackcat
	- ransomware

logsource:
	category: security
	product: windows

detection:
	Event:
		EventID: 4688
		CommandLine|contains:
			- 'cmd' 
			- 'powershell'
	WMIC:
		CommandLine|contains|all:
			- 'wmic'
			- 'shadowcopy'
			- 'delete'
	VSSAdmin:
		CommandLine|contains|all:
			- 'vssadmin'
			- 'delete'
			- 'shadows'
	WBAdmin:
		CommandLine|contains|all:
			- 'wbadmin'
			- 'delete'
			- 'catalog'
	condition: Event AND (WMIC OR VSSAdmin OR WBAdmin)

level: high

falsepositives:
	- Atividades de rotina
	- Execuções legítimas advindas de usuários de serviço

fields:
	- SubjectUserName
	- CommandLine
