title: RDP Remote Assistance Enabled
id: d5e4f97e-25cc-4774-b019-6c8fb333dbc4
status: experimental
description: Detecta a ativação do recurso de Assistência Remota via RDP em um endpoint
author: Sg0luc
date: 2023-09-09
references:
  - https://attack.mitre.org/techniques/T1133/
tags:
  - attack.persistence
  - attack.t1133
logsource:
  product: windows
  category: process_creation
detection:
  Event:
    CommandLine|contains|all:
      - 'reg add'
      - 'Terminal Server'
      - 'fAllowToGetHelp'
      - 'REG_DWORD /d 1'
  condition: Event AND CommandLine
falsepositives:
  - Ativação legítima do recurso de Assistência Remota via RDP
level: medium
fields:
  - SubjectUserName
  - SourceAdress
  - CommandLine
