title: PowerShell Base64-Encoded Command Execution
status: experimental
description: Detecta a execução de comando PowerShell codificado em Base64
author: Sg0luc
date: 2023-09-06
references:
	- https://attack.mitre.org/techniques/T1059/001/
tags:
	- attack.execution
	- powershell
	- base64

logsource:
	category: powershell
	product: windows

detection:
	Event:
		EventID: 4104
		CommandLine|base64:
			- '*'
	condition: Event

level: high

falsepositives:
	- n/a

fields:
	- SubjectUserName
	- SourceAddress
	- CommandLine
