title: Possible UAC Bypass
status: experimental
description: Detecta eventos de possível desativação da chave EnableLUA no Windows, responsável pelo Controle de Conta de Usuário
author: Sg0luc
date: 2023-09-09
referentes:
	- https://attack.mitre.org/techniques/T1548/002/
tags:
	- attack.privilege-escalation
	- registry

logsource:
	category: security
	product: windows

detection:
	Event:
		EventID: 4688
		CommandLine|contains|all:
			- 'reg'
			- 'add'
			- 'EnableLUA'
			- 'REG_DWORD /d 0'
	condition: Event

level: high

falsepositives:
	- n/a

fields:
	- SubjectUserName
	- CommandLine
